define van = Character('Вэн', color="#FFD700")
define ohranik = Character('Охраник', color="#ff0000")
define karpov = Character('Карпов', color="#ff0000")
define chuchmek = Character('Чучмек', color="#ff0000")
define bashlikova = Character('Башлыкова', color="#ff0000")
define dzerzh = Character('Дзержинский', color="#ff0000")
define koshka = Character('Кошка девочка', color="#FF1493")
image ohranik = "ohranik.jpg"
image karpov = "karpov.jpg"
image van_bock = "van_bock.jpg"
image dzerzh = "dzerzh.jpg"
image koshka = "koshka.jpg"
image bashlikova = "bashlikova.jpg"
image chuchmek = "chuchmek.jpg"
image van_ispug = "van_ispug.jpg"
define main_question = 1
label start:
    scene metro
    play music "metro.mp3"
    van """{size=24}"Как же я устал от всего этого говна..." Именно такие мысли были у меня сейчас в голове, когда я ехал на 1 ебанную лекцию в этот долбанный вуз, который не смотря на полный
    локдаун в стране не думал даже переходить на удаленку.{/size}"""
    van """"А может ну его нахуй?" - Такой вопрос никак не мог уйти из головы."""
    menu:
        "Ехать дальше":
             stop music
             jump vhod
        "Да пошло оно все! Ебал я в рот этот вуз. Пойду лучше в свой любимый gym":
             stop music
             jump good_final
label good_final:
    play music "mk.mp3"
    $ renpy.music.set_volume(0.05, delay=0, channel='music') 
    scene good final 1
    "Fuckin slave, give your ass back here!"
    scene good final
    "Жизнь удалась!"
    stop music
    return

label vhod:
    scene mirea
    show van at left
    van """{size=24}"И все же - я тут...". Оглянувшись последний раз я направился ко входу в вуз.{/size}"""
    jump turniketi
label turniketi:
    scene turniketi
    play music "nekro.mp3"
    $ renpy.music.set_volume(0.25, delay=0, channel='music') 
    show van at left
    """{size=24}Первое что бросалось в глаза - это турникеты. Пошарив по карманам, я с ужасом обнаружил, что я забыл дома студак. А до начала лекции осталось всего ничего. Что же делать?{/size}"""
    menu:
        "Выберите действие"
        "Перепрыгнуть турникет и бегом в кабинет!":
             """{size=24}Вы инстинктивно разбежались и...{/size}"""
             play sound "auch.mp3"
             """{size=24}Упали, зацепившись за поручень. Вот это вы неудачник! Забавно, но охраник даже не обратил на вас никакого внимания. Обдино, ведь в такой одежде вы теперь не походите по вузу. Решив это - вы быстро стянули все с себя и отправились дальше в коридор.{/size}"""
             jump koridor_ne_pobeg
        "Попытаться договориться с охраником":
             show ohranik at right
             ohranik """{size=24}Так, так, так... И кто же это у нас тут?{/size}"""
             play sound "sorry.mp3"
             hide van
             show van_bock at left
             van "{size=24}Дядь, пропусти, а?{/size}"
             play sound "what.mp3"
             ohranik """{size=24}Без паники - было бы желание, а договорится всегда можно...{/size}"""
             hide van_bock
             show van_ispug at left
             "{size=24}Вам стало не по себе. У вас нет времени чтобы договариваться с кем-либо.{/size}"
             menu:
                "Выберите действие"
                "Бежать!":
                   jump koridor_pobeg
                "Бежать!":
                   jump koridor_pobeg
label koridor_ne_pobeg:
      $ main_question = 0
      scene koridor
      show van at left
      van """{size=24}Черт, я не помню куда идти! Святые Билли Херингтоны, я даже умудрился оставить свой телефон в карманах одежды. Придется положится на удачу и попробовать отыскать дорогу в кабинет.{/size}"""
      menu:
           "Выберите действие"
           "Вниз! Я раньше ходил туда на занятия, может быть и сегодня мне надо туда...":
                jump koridor_down
           "Налево! Вроде так надо поступать в неопределенных ситуациях... Кажется...":
                jump koridor_left
           "Направо! Там я часто бываю (Правда чтобы похавать). По любому туда!":
                jump koridor_right
           "Наверх! Ближе к богам!":
                jump koridor_up
label koridor_pobeg:
      scene koridor
      """{size=24}Когда вы добежали до коридора, то с ужасом поняли - вы забыли куда бежать! Мало того, вы умудрились потерять на ходу почти всю свою одежду! Да, поездка в вуз сегодня явно не задалась... Но разве настоящего real man волнует что он почти голый? Главный вопрос который волновл вас сейчас - в какую сторону отправится?{/size}"""
      menu:
           "Выберите действие"
           "Вниз! В подвале темно и легче спрятаться.":
                jump koridor_down
           "Налево! Я клятву верности не давал!":
                jump koridor_left
           "Направо! Это моя любимая сторона.":
                jump koridor_right
           "Наверх! Ближе к богам!":
                jump koridor_up
label koridor_up:
      scene koridor_up
      """{size=24}Не успели вы подняться наверх, как вас окликнула фигура в военной форме{/size}"""
      show van_ispug at left
      show dzerzh at right
      dzerzh """{size=24}Рррравняйсь! Смирррно! Почему вы до сих пор здесь, а не копаете окопы под Украиной? А ну - шагом марш в мой кабинет!{/size}"""
      """{size=24}Повинуясь грозной фигуре - вы пошли следом в кабинет Дзержинского{/size}"""
      scene sometimeslater
      scene okopi
      show van_fight at left
      van """{size=24}"Минуточку, как я тут оказался? У меня же отсрочка от армии и зрение минус 100" - были последние ваши мысли перед тем как к вам в окоп прилетел снаряд.{/size}"""
      scene grob
      """{size=24}Жизни великого воина закончилась{/size}"""
      return
label koridor_down:
      scene koridor_down
      """{size=24}Приняв решение - вы паркуря как в кино, ринулись вниз.{/size}"""
      show van at left
      van """{size=24}"Все глубже и глубже..." - думали вы по пути вниз.{/size}"""
      scene door_podval
      """{size=24}Добравшись до самого низа, перед вами появилась тяжелая дверь.{/size}"""
      show van at left
      van """{size=24}"Куда же она ведет? Хотя пофиг, хуже уже точно не будет..." - подумали вы и решили продолжить путь дальше.{/size}"""
      scene koridor_podval
      """{size=24}Перед вами были какие то ящики с электроникой и длинный коридор вперед. Вы решили продолжить путь дальше.{/size}"""
      scene koridor_open_door
      """{size=24}Вдруг перед вами со страшной силы распахнулись все двери в округе. Все было как в кошмаре и вы не знали что делать дальше...{/size}"""
      menu:
            "Выберите действие"
            "Бежать обратно! Это лучший выбор сейчас.":
                """{size=24}Побежав назад, вы услышали много голосов сзади. Что-бы это ни было, вы не собирались проверять. После непродолжительного бега - вы с радостью узнали ту самую дверь куда и должны были прийти.{/size}"""
                jump bashlikova_room
            "ааааааааа":
                scene censored
                """{size=24}Последнее что вы увидели перед смертью - куча голых мужчин выбегающих из двери и радужные флаги в округе. Больше вас никто не видел...{/size}"""
                return
label koridor_left:
      scene koridor_left
      show van at left
      van """{size=24}"Кажется оторвался" - подумали вы. "Вон, и кабинет нужный впереди!"{/size}"""
      jump bashlikova_room
label bashlikova_room:
      scene bashlikova_room
      show van at left
      van """{size=24}"Здравствуйте, извините, что опоздал!"{/size}"""
      show chuchmek at right
      play sound "vah.mp3"
      chuchmek """{size=24}"Вах вах вах, заходи, дарагой! Шашлык будишь?"{/size}"""
      van """{size=24}"Опа! Вы новый заменяющий?"{/size}"""
      chuchmek """{size=24}"Дарагой, я местный уборшик, но выпить с табой не аткажусь."{/size}"""
      menu:
          "Выберите действие"
          "Выпить вместе":
                scene bashlikova_room
                play sound "chok.mp3"
                """{size=24}Вы вместе на глазах у всей группы бахнули по стопочке. Остальные тоже решили показать чего они стоят.{/size}"""
                """{size=24}После этого местный уборщик удалился, а следом за ним вошла Башлыкова{/size}"""
                jump bashlikova_room_1
          "Вежливо отказаться":
                chuchmek """{size=24}Вай, дарагой, да ты не мужик получается...{/size}"""
                """{size=24}После этого местный уборщик удалился, а следом за ним вошла Башлыкова{/size}"""
                jump bashlikova_room_1
label bashlikova_room_1:
      scene bashlikova_room 
      show van at left
      show bashlikova at right
      bashlikova """{size=24}Здравствуйте ученики. Что сдавать сегодня будем?{/size}"""
      """{size=24}Протолкнувшись самым первым, вы решительно двинулись вперед.{/size}"""
      van """{size=24}Можно отчет показать?{/size}"""
      bashlikova """{size=24}Конечно показывайте.{/size}"""
      """{size=24}Вы быстренько открыли отчет и были готовы его показать, но...{/size}"""
      bashlikova """{size=24}Минуточку, а где же титульник? Без него я ничего даже смотреть не буду.{/size}"""
      hide van
      show van_ispug at left
      """{size=24}Вы вспомнили, что в попытке успеть вовремя забыли распечатать титульник к сегодняшнему дню. К тому же - следующий в очереди уже готов был занять ваше место, но вдруг вы вспомнили, что уже 3 раз печатаете титульник и он у вас есть!{/size}"""
      van """{size=24}Вот мой титульник.{/size}"""
      """{size=24}Башлыкова села проверять ваш отчет. Как всегда - даже в четвертый раз результат был тот же...{/size}"""
      bashlikova """{size=24}Так, тут местоимение написано, тут ответ не по ГОСТу, тут вывод весь не по теме, тут пересказ.{/size}"""
      """{size=24}Вообщем, база базовая. Весь текст в отчете снова стал выделенным красным... Вам ничего не оставалось, кроме как признать - ваше поражение неминуемо! Пора домой.{/size}"""
      return
label koridor_right:
      scene koridor_right
      show van at left
      if main_question == 1:
        van """{size=24}Странно, но охраник остановился и в страхе побежал назад. Что же могло вызвать такую реакцию?{/size}"""
      else:
        van """{size=24}Странно... Вы почувствовали какую-то опастность. Но что не так?{/size}"""
      show karpov at right
      karpov """{size=24}Мяу, мяу, мяу...{/size}"""
      hide van
      show van_ispug at left
      van """{size=24}О черт! Это не к добру...{/size}"""
      menu:
           "Выберите действие"
           "Скорее в туалет! Там можно спрятаться в кабинке!":
                jump tualet
           "Помяукать в ответ":
                karpov """{size=24}О, да вы я погляжу разбираетесь в правильном искустве?{/size}"""
                """{size=24}Глаза Карпова засияли каким то странным блеском. Он медленно подошел к вам и тут же вы плавно перестали понимать что происходит...{/size}"""
                jump koshka_devochka
           "Замереть на месте":
                jump karpov_kill
label tualet:
    scene tualet
    show van_ispug at left
    """{size=24}Вы в страхе закрылись в первой попавшейся кабинке. Стук вашего сердца казался невероятно громким и вы не могли отогнать мысль, что вас сейчас поймают...{/size}"""
    karpov """{size=24}Мяу, мяу, мяу...{/size}"""
    van """{size=24}"Кажется он ушел" - подумали вы.{/size}"""
    van """{size=24}"Черт" - вырвался гневный возглас у вас. "До начала пары осталось всего ничего".{/size}"""
    """{size=24}Вы посмотрели в свой записной булыжник и определив, куда вам надо идти, направились в нужный кабинет.{/size}"""
    jump bashlikova_room
label koshka_devochka:
    scene black
    """{size=24}Вы начинали приходить в себя. Страно, вы явно чувствовали что что-то не так...{/size}"""
    scene koshka_devochka
    play music "nyan cat.mp3"
    show koshka at left
    koshka """{size=24}Мяу! Как же я прекрасен! Спасибо вам за открытие моей настоящей сущности!{/size}"""
    koshka """{size=24}Мяу мяу! Я всегда рад помочь познать истину!{/size}"""
    """{size=24}Вы провели весь день, ища следующих жертв для обращенния их в истинную сущность. Вы забыли про свою первоначальную цель, но разве она может заставить вас грустить, когда вы познали новую истину?{/size}"""
    return
label karpov_kill:
    scene koridor_right
    show van_ispug at left
    show karpov at right
    """{size=24}Карпов заметил вас. Улыбаясь и потирая руки, он медленно двинулся в вашем нарпавлении.{/size}"""
    karpov """{size=24}Мяу, уважаемый, а пройдем ка со мной в кабинет!{/size}"""
    van """{size=24}Отпустите пожалуйста, я опаздываю на лекцию башлыковой.{/size}"""
    karpov """{size=24}Не волнуйтесь! Это не займет много времени.{/size}"""
    scene karpov_room
    """{size=24}Это было фатальной ошибкой. До самой ночи проходящие мимо люди слышали страшные звуки из этого кабинета. По словам очевидцев, оттуда доносилось:"Fuckin cat, give your ass back here" или "stick your wiskas in my ass" в перемешку с "oh, yes master!"{/size}"""
    return
